# LayoutRuleFixedDistance Properties

---
The LayoutRuleFixedDistance type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| JustifyType| Get or set the type of justification.
| Spacing| Get or set spacing of the Beam System.
Top
#### Reference
LayoutRuleFixedDistance Class
Autodesk.Revit.DB Namespace